openfoam_cases/plateFinHeatExchanger/constant/fins/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/fins/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    base_fins
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1028;
        startFace       138822;
    }
    fins_to_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          51172;
        startFace       139850;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_fins;
    }
    fins_to_heater
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          72;
        startFace       191022;
        sampleMode      nearestPatchFace;
        sampleRegion    heater;
        samplePatch     heater_to_fins;
    }
)

// ************************************************************************* //
